[
    {
        "role": "Backend Software Developer",
        "organization": "IBM Canada",
        "startDate": "JAN 2023",
        "endDate": "SEPT 2023",
        "experiences": 
        [
            "Wrote python and shell scripts for Red Hat Linux systems to auto-blacklist outdated kernel modules, aligning with stringent security protocols.",
            "Debugged and resolved .iso and .sfs package issues for SIEM software on Linux, utilizing VMWare virtual environments.",
            "Resolved defects using root cause investigation, reducing customer facing bug tickets in team backlog 70% across five product version releases."
        ],
        "tech":
        [
            "JavaScript", 
            "Python",
            "Shell Scripting",
            "Rust",
            "Red Hat Linux",
            "VMware vSphere",
            "Jenkins",
            "Docker"
        ],
        "imageSrc": "history/ibm.png"
    },
    {
        "role": "Software Developer Intern",
        "organization": "IBM Canada",
        "startDate": "JAN 2022",
        "endDate": "APR 2022",
        "experiences": 
        [
            "Developed automation tests written in Groovy to ensure continuous verification of product functionality.",
            "Contributed to a project-wide intiative to prepare the SIEM product to run in an upgraded Red Hat OS environment.",
            "Utilized the Jenkins CI/CD pipeline, Jira, and VMWare to ensure on time delivery of version releases."
        ],
        "tech":
        [
            "JavaScript", 
            "Shell Scripting",
            "Red Hat Linux",
            "VMware vSphere",
            "Jenkins",
            "Docker"
        ],
        "imageSrc": "history/ibm.png"
    },
    {
        "role": "Quality Assurance Engineer Intern",
        "organization": "IBM Canada",
        "startDate": "JAN 2021",
        "endDate": "AUG 2021",
        "experiences": 
        [
            "Formulated and delivered presentations for test plans in preparation for the release of Python version migration and Secure Boot feature.",
            "Performed regression testing, enhancing stability of 4 new product version releases and identified/reported critical defects and inconsistencies for improved software quality",
            "Configured Linux system environments to support various test scenarios for Red Hat installation and patches."
        ],
        "tech":
        [
            "JavaScript", 
            "Red Hat Linux",
            "VMware vSphere",
            "Jenkins"
        ],
        "imageSrc": "history/ibm.png"
    },
    {
        "role": "Associate Software Engineer Intern",
        "organization": "Introhive Services",
        "startDate": "JAN 2020",
        "endDate": "APR 2020",
        "experiences": 
        [
            "Developed an internal front-end Angular component library to standardize and re-use components across all front-end projects.",
            "Contributed to the development and maintenance as a backend developer, executing feature implementations and bug fixes.",
            "Assisted in the formulation and execution of test-cases prior to a new release for quality assurance purposes."
        ],
        "tech":
        [
            "Ruby on Rails",
            "AngularJS",
            "UI Design"
        ],
        "imageSrc": "history/ibm.png"
    }
]